Tekla.Structures.Drawing.AlongLinePlacingType
The AlongLinePlacingType class defines a placing type that
places the object using the along line placing.

Tekla.Structures.Drawing.AlongLinePlacingType.#ctor
Creates a new along line placing type instance.